#### Origin Property

---

|  |
| --- |
| View Class   See Also |

Returns the origin of the screen.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Origin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Origin As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Origin { 	XYZ^ get (); } ``` |

#### Field Value

   a null reference (  Nothing  in Visual Basic)  if the view is a template.

# Remarks

The origin of a plan view is not meaningful.

# See Also

View Class

Autodesk.Revit.DB Namespace